In [142]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [135]:
data = pd.read_csv("D:\\DSA\\Python\\StudentsPerformance.csv")
data.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [136]:
data.info

<bound method DataFrame.info of      gender race/ethnicity parental level of education         lunch  \
0    female        group C            some high school  free/reduced
1    female        group B                 high school  free/reduced
2    female        group B            some high school  free/reduced
3    female        group B                some college      standard
4    female        group C                some college  free/reduced
..      ...            ...                         ...           ...
995    male        group E                some college      standard
996    male        group A                some college      standard
997    male        group D                some college      standard
998    male        group E          associate's degree  free/reduced
999    male        group E           bachelor's degree      standard

    test preparation course  math score  reading score  writing score
0                      none           0             17             10
1                      none           8             24             23
2                      none          18             32             28
3                      none          11             38             32
4                      none          22             39             33
..                      ...         ...            ...            ...
995               completed          99             87             81
996               completed         100             96             86
997               completed         100             97             99
998               completed         100            100             93
999               completed         100            100            100

[1000 rows x 8 columns]>

In [137]:
data.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

# 1.Find out how many males and females participated in the test

In [143]:
data['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

# 2.What do you think about the student's parental level of education

In [38]:
data1 = data.groupby(["parental level of education"]).sum()
data1

                             math score  reading score  writing score
parental level of education
associate's degree                15091          15766          15547
bachelor's degree                  8176           8614           8659
high school                       12117          12662          12231
master's degree                    4145           4481           4465
some college                      15171          15722          15602
some high school                  11301          11950          11615

# 3.Who scores the most on average for math, reading and writing

In [151]:
data1 = data.groupby('gender').mean()
data1 = pd.DataFrame(data1).reset_index()
data1

   gender  math score  reading score  writing score
0  female   63.376448      72.590734      72.467181
1    male   68.821577      65.545643      63.446058

In [93]:
data2 = data.groupby('test preparation course').mean()
data2 = pd.DataFrame(data2).reset_index()
data2

  test preparation course  math score  reading score  writing score
0               completed    69.96648      74.175978      74.684358
1                    none    63.78972      66.417445      64.457944

# 4.What do you think about the scoring variation for math, reading and writing

In [165]:
data1 = data.groupby(["gender"]).std()
data1

        math score  reading score  writing score
gender
female   16.029928      14.411018      14.844842
male     14.556411      14.149594      14.227225

In [166]:
data2 = data.groupby('test preparation course').std()
data2 = pd.DataFrame(data2).reset_index()
data2

  test preparation course  math score  reading score  writing score
0               completed   14.521847      13.537572      13.236412
1                    none   15.705689      14.608896      15.041667

# 5.Give bonus points to the top 25% of students based on their maths score

In [171]:
data.sort_values("math score",ascending=False)[1:250]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
996,male,group A,some college,standard,completed,100,96,86
515,female,group E,some college,standard,none,100,92,97
517,female,group E,associate's degree,standard,none,100,100,100
516,female,group E,bachelor's degree,standard,none,100,100,100
997,male,group D,some college,standard,completed,100,97,99
...,...,...,...,...,...,...,...,...
856,male,group E,some high school,standard,completed,77,76,77
855,male,group E,associate's degree,free/reduced,completed,77,69,68
854,male,group D,some high school,standard,completed,77,68,69
853,male,group D,associate's degree,free/reduced,none,77,78,73
852,male,group D,some college,free/reduced,none,77,62,64